{
    "id": 1,
    "data": [
        {
            "id": 0,
            "data": [
                {
                    "name": "Rain",
                    "text": ["It's so hot as usual...", "Time to check what things I need to do today.", "Let's go talk to Cecilia below. She should be in her usual spot beside the lake."]
                }
            ]
        },
        {
            "id": 1,
            "data": [
                {
                    "name": "Cecilia",
                    "text": ["Hey Rain, are you still having those dreams? You seem to get them a lot ever since you went missing in that cave a few years back."]
                },
                {
                    "name": "Rain",
                    "text": ["Ah yeah… That day I was playing hide-and-seek with you but ended up falling into a cave. The cave was very, very dark, but there was something shining in the middle, a black crystal.", "Out of curiosity I tried to touch it, but I can’t seem to recall what happened after that.."]
                }, 
                {
                    "name": "Cecilia",
                    "text": ["Oh, I remember that day… After you went missing, the whole village set out in the forest to look for you! And we just found you sleeping in a field."]
                },
                {
                    "name": "Rain",
                    "text": ["I wonder what happened then…"]
                },
                {
                    "name": "Cecilia",
                    "text": ["Anyway, the number of slimes in the forest seems to be increasing lately, and they appear to be more aggressive. The chief requested you to help thin out their numbers."]
                },
                {
                    "name": "Rain",
                    "text": ["Sure, leave it to me!"]
                },
                {
                    "name": "Cecilia",
                    "text": ["Be careful out there!"]
                }
            ]
        },
        {
            "id": 2,
            "data": [
                {
                    "name": "Rain",
                    "text": ["Alright, that should settle things for now. Hmmm, since I’m here, maybe I should look for some of Cecilia’s favorite flowers. I’m sure it’ll be a pleasant surprise for her."]
                }
            ]
        },
        {
            "id": 3,
            "data": [
                {
                    "name": "Rain",
                    "text": ["Hmm? What’s that crystal? Let’s take a closer look.."]
                }
            ]
        },
        {
            "id": 4,
            "data": [
                {
                    "name": "",
                    "text": ["The black wisp flickered, it’s voice weakening as it faded out."]
                }, 
                {
                    "name": "Shadow",
                    "text": ["Young hero, my power is fading...", "Find the other fragments… before the world is destroyed."]
                },
                {
                    "name": "",
                    "text": ["The black wisp vanished into the ground overlapping the young hero’s shadow."]
                }
            ]
        },
        {
            "id": 5,
            "data": [
                {
                    "name": "Rain",
                    "text": ["What was that?! Was that my… memories from when I was in the cave?", "And who are you, or rather, what are you!? Why do you look like me?"]
                }, 
                {
                    "name": "Shadow",
                    "text": ["I have no idea… I can’t remember anything…", "But… I feel some sort of connection to you… Do you know anything about me?"]
                },
                {
                    "name": "Rain",
                    "text": ["(thinking to himself) Is he the black wisp I saw in the cave? But he doesn’t remember anything… Argh there’s too many questions and no answers. Maybe I should bring him back with me first?", "Alright, honestly I have no clue as to who and what you are. But since you seem to be connected to me, how about you come with me? Not that you seem to have a choice though… What’s your name?"]
                },
                {
                    "name": "Shadow",
                    "text": ["I’ll… follow you. As for a name, I don’t remember at all."]
                },
                {
                    "name": "Rain",
                    "text": ["Hmmm… Then I’ll call you Pancakes! Listen here Pancakes, my dream is to become a top-tier adventurer with lots of gold to spare. Let’s explore the world together and find some treasure!"]
                }
            ]
        },
        {
            "id": 6,
            "data": [
                {
                    "name": "Rain",
                    "text": ["Ah, where did these slimes appear from! This is going to be troublesome."]
                }, 
                {
                    "name": "Pancakes",
                    "text": ["I think I can aid you in battle. I can’t recall much of where I came from, but I can fight. Let me help you."]
                }, 
                {
                    "name": "Pancakes",
                    "text": ["You can use my ultimate with the V or Q button! That'll make life easier."]
                }
            ]
        },
        {
            "id": 7,
            "data": [
                {
                    "name": "Rain",
                    "text": ["Wow Pancakes, you’re pretty strong! Well that should be alright for now, let’s head back to the village first, otherwise Cecilia’s going to get worried."]
                }
            ]
        },
        {
            "id": 8,
            "data": [
                {
                    "name": "Cecilia",
                    "text": ["There seems to be some sort of commotion in the forest today. The chief requested you to check if there’s anything out of the ordinary that might have caused this."]
                }, 
                {
                    "name": "Rain",
                    "text": ["I’ll take care of it!"]
                }, 
                {
                    "name": "Cecilia",
                    "text": ["Don’t push yourself too much alright! Just check things out and come back safely Rain."]
                },
                {
                    "name": "Rain",
                    "text": ["I got it I got it~"]
                }
            ]
        },
        {
            "id": 9,
            "data": [
                {
                    "name": "Rain",
                    "text": ["Woah, it’s… a dungeon? It wasn’t here before.. A dungeon just opened up next to the village?"]
                }, 
                {
                    "name": "Pancakes",
                    "text": ["There’s something mysteriously familiar about this place…", "I feel… as if it’s calling out to me to go in…"]
                }, 
                {
                    "name": "Rain",
                    "text": ["Could the appearance of this dungeon be linked to Pancakes? It appeared the day after I found another crystal in the forest…", "I think I might find some answers as to what Pancakes is in here. But it might be dangerous, so we should make more preparations before entering. I need to let the village know as well."]
                }
            ]
        },
        {
            "id": 10,
            "data": [
                {
                    "name": "Elder",
                    "text": ["What, a dungeon appeared next to our village?! Hmmm…….", "This might be a chance for the village to earn more money, dungeon loot is pretty valuable… Alright, I’ll prepare an expedition party to explore the dungeon."]
                },
                {
                    "name": "Rain",
                    "text": ["Elder, could I join the expedition too?"]
                }, 
                {
                    "name": "Elder",
                    "text": ["No, it is too dangerous, we don’t know what might be in there yet. We’ll wait for the party to explore the dungeon first before we decide anything else.", "That’s the end of the discussion. Go back and rest, Rain. You’ve worked hard these few days. I will inform the village of the dungeon shortly."]
                },
                {
                    "name": "Rain",
                    "text": ["Alright…"]
                }
            ]
        },
        {
            "id": 11,
            "data": [
                {
                    "name": "",
                    "text": ["It has been a week after the expedition party has left for the dungeon.", "The village had not heard from them again.", "The village elder sent a messenger to the Empire and the Adventurer’s Guild to seek help in exploring the dungeon and finding out what happened to the expedition party.", "Meanwhile, the village elder has forbidden everyone from entering the dungeon."]
                }
            ]
        },
        {
            "id": 12,
            "data": [
                {
                    "name": "Pancakes",
                    "text": ["Rain… The dungeon’s call is getting stronger. I can feel the darkness within the dungeon growing. Something bad is going to happen at this rate."]
                }
            ]
        }
        
    ]
}