{
    "id": 0,
    "data": [
        {
            "id": 0,
            "data": [
                {
                    "name": "",
                    "text": [
                        "This is a story of a past long forgotten.",
                        "In this world, there once lived a strong ancient hero. With a dragon by his side, the hero conquered the continent and brought peace to the war-torn land. ",
                        "He founded an empire, and the world prospered in these peaceful times.",
                        "The dragon swore an oath to defend the empire against enemies of the empire. Alas, this was not to be.",
                        "As centuries and the generations passed, the dragon grew weary. The hero that he had sworn his bond too was no longer in the world, yet he continues to look upon the world that they once shared.",
                        "The kingdom that was once glorious had worn down through peace, the nobles bathed in their wealth batting nary a eye to governing the people. The honourable kingdom was no more.",
                        "The dragon retreated to the den and sealed himself away. For he could not go back on the oath he made with the hero even as much as he despised the current kingdom."
                    ]
                },
                {
                    "name": "",
                    "text": ["... ..."]
                },
                {
                    "name": "",
                    "text": ["Please choose your player's character class: "]
                }
            ]
        },
        {
            "id": 1,
            "data": [
                {
                    "name": "",
                    "text": ["Please choose your shadow's character class: "]
                }
            ]
        },
        {
            "id": 2,
            "data": [
                {
                    "name": "",
                    "text": ["Your journey has just begun."]
                }
            ]
        },
        {
            "id": 3,
            "data": [
                {
                    "name": "Rain",
                    "text": ["Wow! I leveled up!", "Let's see if I've gotten any stronger."]
                },
                {
                    "name": "Tutorial",
                    "text": ["Open the pause menu with 'X' or escape key.", "Select stats to view your stats.", "You can assign your character stats to make them stronger!"]
                }
            ]
        },
        {
            "id": 4,
            "data": [
                {
                    "name": "Tutorial",
                    "text": ["Switch between you and your shadow with the C or Q button."]
                }
            ]
        }
    ]
}